apache/nuttx/arch/arm/src/rp2040/rp2040_i2c.c
  /* Enable TX_EMPTY interrupt for determine transfer done. */

  i2c_reg_rmw(priv, RP2040_I2C_IC_INTR_MASK_OFFSET,
              RP2040_I2C_IC_INTR_STAT_R_TX_EMPTY,
              RP2040_I2C_IC_INTR_STAT_R_TX_EMPTY);
  leave_critical_section(flags);

  nxsem_wait_uninterruptible(&priv->wait);
  return 0;
}

/****************************************************************************
 * Name: rp2040_i2c_transfer
 *
 * Description:
 *   Perform a sequence of I2C transfers
 *
 * TODO: Multiple i2c_msg_s read operations with the same address are not
 * currently guaranteed.
 ****************************************************************************/

static int rp2040_i2c_transfer(struct i2c_master_s *dev,
                               struct i2c_msg_s *msgs, int count)
{
  struct rp2040_i2cdev_s *priv = (struct rp2040_i2cdev_s *)dev;
  int i;
  int ret    = 0;
  int semval = 0;
  int addr = -1;
  static int wostop = 0;

  DEBUGASSERT(dev != NULL);

  /* Get exclusive access to the I2C bus */

  nxmutex_lock(&priv->lock);

  /* Check wait semaphore value. If the value is not 0, the transfer can not
   * be performed normally.
   */

  ret = nxsem_get_value(&priv->wait, &semval);
  DEBUGASSERT(ret == OK && semval == 0);

  for (i = 0; i < count; i++, msgs++)
    {
      /* Pass msg descriptor via device context */

      priv->msgs  = msgs;
      priv->error = OK;

      if ((addr != msgs->addr) && !wostop)
        {
          rp2040_i2c_disable(priv);

          rp2040_i2c_setfrequency(priv, msgs->frequency);

          i2c_reg_rmw(priv, RP2040_I2C_IC_CON_OFFSET,
                      RP2040_I2C_IC_CON_IC_RESTART_EN,
                      RP2040_I2C_IC_CON_IC_RESTART_EN);
          i2c_reg_write(priv, RP2040_I2C_IC_TAR_OFFSET, msgs->addr & 0x7f);

          rp2040_i2c_enable(priv);
          addr = msgs->addr;
        }

      if (msgs->flags & I2C_M_NOSTOP)
        {
          /* Don't send stop condition even if the last data */

          wostop = 1;
        }
      else
        {
          wostop = 0;
        }

      if (msgs->flags & I2C_M_READ)
        {
          ret = rp2040_i2c_receive(priv, (wostop) ? 0 : (i + 1 == count));
        }
      else
        {
          ret = rp2040_i2c_send(priv, (wostop) ? 0 : (i + 1 == count));
        }

      if (ret < 0)
        {
          break;
        }

      if (priv->error != OK)
        {
          ret = priv->error;
          break;
        }

      /* Clear msg descriptor for prevent illegal access in interrupt */

      priv->msgs = NULL;
    }

  if (!wostop)
    {
      rp2040_i2c_disable(priv);
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: rp2040_i2c_reset
 *
 * Description:
 *   Perform an I2C bus reset in an attempt to break loose stuck I2C devices.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_RESET
static int rp2040_i2c_reset(struct i2c_master_s *dev)
{
  struct rp2040_i2cdev_s *priv = (struct rp2040_i2cdev_s *)dev;
  unsigned int clock_count;
  unsigned int stretch_count;
  uint32_t scl_gpio;
  uint32_t sda_gpio;
  uint32_t subsys;
  uint32_t frequency;
  int pin;
  int ret;

  DEBUGASSERT(dev);

  /* Our caller must own a ref */

  DEBUGASSERT(priv->refs > 0);

  /* Lock out other clients */

  nxmutex_lock(&priv->lock);
  ret = -EIO;

  /* De-init the port */

  rp2040_i2c_disable(priv);

  /* Use GPIO configuration to un-wedge the bus */

  pin = rp2040_gpio_get_function_pin(RP2040_GPIO_FUNC_I2C, priv->port);
  if (pin < 0)
    {
      goto out_without_reinit;
    }

  sda_gpio = pin;
  scl_gpio = pin + 1;
  subsys = (priv->port == 0) ? RP2040_RESETS_RESET_I2C0 :
                               RP2040_RESETS_RESET_I2C1;

  rp2040_gpio_init(sda_gpio);
  rp2040_gpio_setdir(sda_gpio, true);
  rp2040_gpio_set_pulls(sda_gpio, true, false);  /* Pull up */
  rp2040_gpio_put(sda_gpio, true);

  rp2040_gpio_init(scl_gpio);
  rp2040_gpio_setdir(scl_gpio, true);
  rp2040_gpio_set_pulls(scl_gpio, true, false);
  rp2040_gpio_put(scl_gpio, true);

  /* Let SDA go high */

  rp2040_gpio_put(sda_gpio, true);

  /* Clock the bus until any slaves currently driving it let it go. */

  clock_count = 0;
  while (!rp2040_gpio_get(sda_gpio))
    {
      /* Give up if we have tried too hard */

      if (clock_count++ > 10)
        {
          goto out;
        }

      /* Sniff to make sure that clock stretching has finished. If the bus
       * never relaxes, the reset has failed.
       */

      stretch_count = 0;
      while (!rp2040_gpio_get(scl_gpio))
        {
          /* Give up if we have tried too hard */

          if (stretch_count++ > 10)
            {
              goto out;
            }

          up_udelay(10);
        }

      /* Drive SCL low */

      rp2040_gpio_put(scl_gpio, false);
      up_udelay(10);

      /* Drive SCL high again */

      rp2040_gpio_put(scl_gpio, true);
      up_udelay(10);
    }

  /* Generate a start followed by a stop to reset slave state machines. */

  rp2040_gpio_put(sda_gpio, false);
  up_udelay(10);
  rp2040_gpio_put(scl_gpio, false);
  up_udelay(10);
  rp2040_gpio_put(scl_gpio, true);
  up_udelay(10);
  rp2040_gpio_put(sda_gpio, true);
  up_udelay(10);

  ret = OK;

out:

  /* Revert the GPIO configuration. */

  rp2040_gpio_set_function(sda_gpio, RP2040_GPIO_FUNC_I2C);
  rp2040_gpio_set_function(scl_gpio, RP2040_GPIO_FUNC_I2C);

  /* Reset I2C subsystem */

  setbits_reg32(subsys, RP2040_RESETS_RESET);
  clrbits_reg32(subsys, RP2040_RESETS_RESET);
  while ((getreg32(RP2040_RESETS_RESET_DONE) & subsys) == 0)
    ;

  /* Re-init the port */

  rp2040_i2c_disable(priv);
  rp2040_i2c_init(priv);

  /* Restore the frequency */

  frequency = priv->frequency;
  priv->frequency = 0;
  rp2040_i2c_setfrequency(priv, frequency);

out_without_reinit:

  /* Release the port for reuse by other clients */

  nxmutex_unlock(&priv->lock);
  return ret;
}
#endif /* CONFIG_I2C_RESET */

static inline uint32_t i2c_reg_read(struct rp2040_i2cdev_s *priv,
                                    uint32_t offset)
{
  return getreg32(priv->base + offset);
}

