apache/nuttx/arch/arm/src/rp2040/rp2040_i2c.c
static inline void i2c_reg_write(struct rp2040_i2cdev_s *priv,
                                 uint32_t offset, uint32_t val)
{
  putreg32(val, priv->base + offset);
}

static inline void i2c_reg_rmw(struct rp2040_i2cdev_s *priv, uint32_t offset,
                               uint32_t val, uint32_t mask)
{
  modbits_reg32(val, mask, priv->base + offset);
}

static int rp2040_i2c_disable(struct rp2040_i2cdev_s *priv)
{
  int retry = 25000;
  uint32_t stat;

  /* disable all interrupt */

  i2c_reg_write(priv, RP2040_I2C_IC_INTR_MASK_OFFSET, 0x0);

  /* clear all interrupt status */

  i2c_reg_read(priv, RP2040_I2C_IC_CLR_INTR_OFFSET);
  i2c_reg_write(priv, RP2040_I2C_IC_ENABLE_OFFSET, 0);

  do
    {
      stat = i2c_reg_read(priv, RP2040_I2C_IC_ENABLE_STATUS_OFFSET);
    }
  while (--retry && (stat & RP2040_I2C_IC_ENABLE_STATUS_IC_EN));

  if (!retry)
    {
      i2cerr("i2c wait timeout.\n");
      return -EBUSY;
    }

  /* clear all interrupt status again */

  i2c_reg_read(priv, RP2040_I2C_IC_CLR_INTR_OFFSET);

  return 0;
}

static void rp2040_i2c_init(struct rp2040_i2cdev_s *priv)
{
  i2c_reg_write(priv, RP2040_I2C_IC_INTR_MASK_OFFSET, 0x00);
  i2c_reg_read(priv, RP2040_I2C_IC_CLR_INTR_OFFSET);

  /* set threshold level of the Rx/Tx FIFO */

  i2c_reg_write(priv, RP2040_I2C_IC_RX_TL_OFFSET, 0xff);
  i2c_reg_write(priv, RP2040_I2C_IC_TX_TL_OFFSET, 0);

  /* set hold time for margin */

  i2c_reg_write(priv, RP2040_I2C_IC_SDA_HOLD_OFFSET, 1);

  i2c_reg_write(priv, RP2040_I2C_IC_CON_OFFSET,
                (RP2040_I2C_IC_CON_IC_SLAVE_DISABLE |
                 RP2040_I2C_IC_CON_MASTER_MODE |
                 RP2040_I2C_IC_CON_TX_EMPTY_CTRL));
}

static void rp2040_i2c_enable(struct rp2040_i2cdev_s *priv)
{
  i2c_reg_write(priv, RP2040_I2C_IC_INTR_MASK_OFFSET, I2C_INTR_ENABLE);
  i2c_reg_write(priv, RP2040_I2C_IC_ENABLE_OFFSET, 1);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rp2040_i2cbus_initialize
 *
 * Description:
 *   Initialise an I2C device
 *
 ****************************************************************************/

struct i2c_master_s *rp2040_i2cbus_initialize(int port)
{
  struct rp2040_i2cdev_s *priv;

#ifdef CONFIG_RP2040_I2C0
  if (port == 0)
    {
      priv          = &g_i2c0dev;
      priv->dev.ops = &rp2040_i2c_ops;
    }
  else
#endif
#ifdef CONFIG_RP2040_I2C1
  if (port == 1)
    {
      priv          = &g_i2c1dev;
      priv->dev.ops = &rp2040_i2c_ops;
    }
  else
#endif
    {
      i2cerr("I2C Only support 0,1\n");
      return NULL;
    }

  nxmutex_lock(&priv->lock);

  /* Test if already initialized or not */

  if (1 < ++priv->refs)
    {
      nxmutex_unlock(&priv->lock);
      return &priv->dev;
    }

  priv->port      = port;
  priv->frequency = 0;

  priv->base_freq = BOARD_PERI_FREQ;

  rp2040_i2c_disable(priv);
  rp2040_i2c_init(priv);
  rp2040_i2c_setfrequency(priv, I2C_DEFAULT_FREQUENCY);

  /* Attach Interrupt Handler */

  irq_attach(priv->irqid, rp2040_i2c_interrupt, priv);

  /* Enable Interrupt Handler */

  up_enable_irq(priv->irqid);

  nxmutex_unlock(&priv->lock);
  return &priv->dev;
}

/****************************************************************************
 * Name: rp2040_i2cbus_uninitialize
 *
 * Description:
 *   Uninitialise an I2C device
 *
 ****************************************************************************/

int rp2040_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct rp2040_i2cdev_s *priv = (struct rp2040_i2cdev_s *)dev;

  /* Decrement reference count and check for underflow */

  if (priv->refs == 0)
    {
      return ERROR;
    }

  nxmutex_lock(&priv->lock);
  if (--priv->refs)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  rp2040_i2c_disable(priv);

  up_disable_irq(priv->irqid);
  irq_detach(priv->irqid);

  wd_cancel(&priv->timeout);
  nxmutex_unlock(&priv->lock);

  return OK;
}

#endif /* CONFIG_RP2040_I2C */
